In [3]:
import pandas as pd

In [2]:
people = {
    "first" : ["Jyoti", "Bhumika","Kermeen","Gauri"],
    "second" : ["Kumbhar", "Shelar","Deboo","Kumbhar"],
    "third" : ["J@gmail.com","BS@gmail.com","K@gmail.com","GK@gmail.com"]
}

In [4]:
df = pd.DataFrame(people)
df

     first   second         third
0    Jyoti  Kumbhar   J@gmail.com
1  Bhumika   Shelar  BS@gmail.com
2  Kermeen    Deboo   K@gmail.com
3    Gauri  Kumbhar  GK@gmail.com

In [5]:
df.columns

Index(['first', 'second', 'third'], dtype='object')

In [9]:
df.columns=['firstName','lastName','email']
df.columns

Index(['firstName', 'lastName', 'email'], dtype='object')

In [7]:
df

  firstName lastName         email
0     Jyoti  Kumbhar   J@gmail.com
1   Bhumika   Shelar  BS@gmail.com
2   Kermeen    Deboo   K@gmail.com
3     Gauri  Kumbhar  GK@gmail.com

In [10]:
df.columns=[x.upper() for x in df.columns]
df

  FIRSTNAME LASTNAME         EMAIL
0     Jyoti  Kumbhar   J@gmail.com
1   Bhumika   Shelar  BS@gmail.com
2   Kermeen    Deboo   K@gmail.com
3     Gauri  Kumbhar  GK@gmail.com

In [11]:
df.columns=[x.lower() for x in df.columns]
df

  firstname lastname         email
0     Jyoti  Kumbhar   J@gmail.com
1   Bhumika   Shelar  BS@gmail.com
2   Kermeen    Deboo   K@gmail.com
3     Gauri  Kumbhar  GK@gmail.com

In [12]:
df.columns=['first name','last name','email']
df

  first name last name         email
0      Jyoti   Kumbhar   J@gmail.com
1    Bhumika    Shelar  BS@gmail.com
2    Kermeen     Deboo   K@gmail.com
3      Gauri   Kumbhar  GK@gmail.com

In [14]:
## to remove spaces from column name
df.columns=df.columns.str.replace(' ','_')
df

  first_name last_name         email
0      Jyoti   Kumbhar   J@gmail.com
1    Bhumika    Shelar  BS@gmail.com
2    Kermeen     Deboo   K@gmail.com
3      Gauri   Kumbhar  GK@gmail.com

In [15]:
# used to replace the names of specific columns
df.rename(columns={'first_name':'first', 'email':'Email'},inplace=True)
df

     first last_name         Email
0    Jyoti   Kumbhar   J@gmail.com
1  Bhumika    Shelar  BS@gmail.com
2  Kermeen     Deboo   K@gmail.com
3    Gauri   Kumbhar  GK@gmail.com

In [21]:
# update specific data in an row
df.loc[0,['Email']] = ['Jyoti@gmail.com']
df

     first last_name            Email
0    Jyoti   Kumbhar  Jyoti@gmail.com
1  Bhumika    Shelar     BS@gmail.com
2  Kermeen     Deboo      K@gmail.com
3    Gauri   Kumbhar     GK@gmail.com

In [22]:
## method2
df.at[1,'Email'] = 'Bhumika@gmail.com'
df

     first last_name              Email
0    Jyoti   Kumbhar    Jyoti@gmail.com
1  Bhumika    Shelar  Bhumika@gmail.com
2  Kermeen     Deboo        K@gmail.com
3    Gauri   Kumbhar       GK@gmail.com

In [28]:
## method3
filt = (df['first']=='Kermeen')
df.loc[filt,'Email']='Kermeen@gmail.com'
df

     first last_name              Email              email
0    Jyoti   Kumbhar    Jyoti@gmail.com                NaN
1  Bhumika    Shelar  Bhumika@gmail.com                NaN
2  Kermeen     Deboo  Kermeen@gmail.com  Kermeen@gmail.com
3    Gauri   Kumbhar       GK@gmail.com                NaN

In [30]:
# change mulitple rows at once
df['first'] = df['first'].str.lower()
df

     first last_name              Email              email
0    jyoti   Kumbhar    Jyoti@gmail.com                NaN
1  bhumika    Shelar  Bhumika@gmail.com                NaN
2  kermeen     Deboo  Kermeen@gmail.com  Kermeen@gmail.com
3    gauri   Kumbhar       GK@gmail.com                NaN

In [31]:
#apply using on series
df['Email'].apply(len)

0    15
1    17
2    17
3    12
Name: Email, dtype: int64

In [32]:
def update_email(email):
    return email.upper()

In [34]:
df['Email'].apply(update_email)

0      JYOTI@GMAIL.COM
1    BHUMIKA@GMAIL.COM
2    KERMEEN@GMAIL.COM
3         GK@GMAIL.COM
Name: Email, dtype: object

In [35]:
df

     first last_name              Email              email
0    jyoti   Kumbhar    Jyoti@gmail.com                NaN
1  bhumika    Shelar  Bhumika@gmail.com                NaN
2  kermeen     Deboo  Kermeen@gmail.com  Kermeen@gmail.com
3    gauri   Kumbhar       GK@gmail.com                NaN

In [36]:
df['Email']=df['Email'].apply(update_email)
df

     first last_name              Email              email
0    jyoti   Kumbhar    JYOTI@GMAIL.COM                NaN
1  bhumika    Shelar  BHUMIKA@GMAIL.COM                NaN
2  kermeen     Deboo  KERMEEN@GMAIL.COM  Kermeen@gmail.com
3    gauri   Kumbhar       GK@GMAIL.COM                NaN

In [37]:
#another method to do same task
df['Email']=df['Email'].apply(lambda x:x.lower())
df

     first last_name              Email              email
0    jyoti   Kumbhar    jyoti@gmail.com                NaN
1  bhumika    Shelar  bhumika@gmail.com                NaN
2  kermeen     Deboo  kermeen@gmail.com  Kermeen@gmail.com
3    gauri   Kumbhar       gk@gmail.com                NaN

In [40]:
#apply using on data frame

#default axis is rows
df.apply(len)

first        4
last_name    4
Email        4
email        4
dtype: int64

In [41]:
df.apply(len, axis='columns')

0    4
1    4
2    4
3    4
dtype: int64

In [ ]:
#applymap
df.applymap(len)
df.applymap(str.lower)

In [50]:
df['first'].map({'jyoti':'J','bhumika':'B'})

0      J
1      B
2    NaN
3    NaN
Name: first, dtype: object

In [51]:
df['first'].replace({'jyoti':'J','bhumika':'B'})

0          J
1          B
2    kermeen
3      gauri
Name: first, dtype: object

In [52]:
df

     first last_name              Email              email
0    jyoti   Kumbhar    jyoti@gmail.com                NaN
1  bhumika    Shelar  bhumika@gmail.com                NaN
2  kermeen     Deboo  kermeen@gmail.com  Kermeen@gmail.com
3    gauri   Kumbhar       gk@gmail.com                NaN

In [53]:
df['first']=df['first'].replace({'jyoti':'J','bhumika':'B'})

In [54]:
df

     first last_name              Email              email
0        J   Kumbhar    jyoti@gmail.com                NaN
1        B    Shelar  bhumika@gmail.com                NaN
2  kermeen     Deboo  kermeen@gmail.com  Kermeen@gmail.com
3    gauri   Kumbhar       gk@gmail.com                NaN

In [55]:
#demo6

In [60]:
#combining two columns
df['Name']=df['first']+' '+df['last_name']
df

     first last_name              Email              email           Name
0        J   Kumbhar    jyoti@gmail.com                NaN      J Kumbhar
1        B    Shelar  bhumika@gmail.com                NaN       B Shelar
2  kermeen     Deboo  kermeen@gmail.com  Kermeen@gmail.com  kermeen Deboo
3    gauri   Kumbhar       gk@gmail.com                NaN  gauri Kumbhar

In [ ]:
#remove an column
df = df.drop(columns=['first','last_name','Email'])

In [86]:
df.columns=[x.upper() for x in df.columns]
df

               EMAIL           NAME
0    jyoti@gmail.com      J Kumbhar
1  bhumika@gmail.com       B Shelar
2  kermeen@gmail.com  kermeen Deboo
3       gk@gmail.com  gauri Kumbhar

In [87]:
#splitting a column
df['NAME'].str.split(' ', expand=True)

         0        1
0        J  Kumbhar
1        B   Shelar
2  kermeen    Deboo
3    gauri  Kumbhar

In [88]:
df[['first','last']]=df['NAME'].str.split(' ', expand=True)

In [89]:
df

               EMAIL           NAME    first     last
0    jyoti@gmail.com      J Kumbhar        J  Kumbhar
1  bhumika@gmail.com       B Shelar        B   Shelar
2  kermeen@gmail.com  kermeen Deboo  kermeen    Deboo
3       gk@gmail.com  gauri Kumbhar    gauri  Kumbhar

In [90]:
df.columns=[x.lower() for x in df.columns]
df

               email           name    first     last
0    jyoti@gmail.com      J Kumbhar        J  Kumbhar
1  bhumika@gmail.com       B Shelar        B   Shelar
2  kermeen@gmail.com  kermeen Deboo  kermeen    Deboo
3       gk@gmail.com  gauri Kumbhar    gauri  Kumbhar

In [94]:
#adding a new data
new_row = pd.DataFrame([{'first': 'Tony','last':'Stark'}])

# Use pd.concat() to append
df = pd.concat([df, new_row], ignore_index=True)

In [95]:
df

               email           name    first     last
0    jyoti@gmail.com      J Kumbhar        J  Kumbhar
1  bhumika@gmail.com       B Shelar        B   Shelar
2  kermeen@gmail.com  kermeen Deboo  kermeen    Deboo
3       gk@gmail.com  gauri Kumbhar    gauri  Kumbhar
4                NaN            NaN     Tony    Stark

In [100]:
Arendelle = {
    "first" : ["Queen", "Princess"],
    "last" : ["Elsa", "Anna"],
    "email" : ["QueenElsa@gmail.com","PrincessAnna@gmail.com"]
}
df2 = pd.DataFrame(Arendelle)

In [101]:
df2

      first  last                   email
0     Queen  Elsa     QueenElsa@gmail.com
1  Princess  Anna  PrincessAnna@gmail.com

In [102]:
#add data from another data frame
df = pd.concat([df, df2], ignore_index=True)

In [110]:
df
##ignore index because of some error i made

                    email           name     first     last
0         jyoti@gmail.com      J Kumbhar         J  Kumbhar
1       bhumika@gmail.com       B Shelar         B   Shelar
2       kermeen@gmail.com  kermeen Deboo   kermeen    Deboo
3            gk@gmail.com  gauri Kumbhar     gauri  Kumbhar
4                     NaN            NaN      Tony    Stark
7     QueenElsa@gmail.com            NaN     Queen     Elsa
8  PrincessAnna@gmail.com            NaN  Princess     Anna

In [111]:
##drop an row
df=df.drop(index=4)

In [112]:
df

                    email           name     first     last
0         jyoti@gmail.com      J Kumbhar         J  Kumbhar
1       bhumika@gmail.com       B Shelar         B   Shelar
2       kermeen@gmail.com  kermeen Deboo   kermeen    Deboo
3            gk@gmail.com  gauri Kumbhar     gauri  Kumbhar
7     QueenElsa@gmail.com            NaN     Queen     Elsa
8  PrincessAnna@gmail.com            NaN  Princess     Anna

In [115]:
filt=df['last']=='Kumbhar'
df=df.drop(index=df[filt].index)
df

                    email           name     first    last
1       bhumika@gmail.com       B Shelar         B  Shelar
2       kermeen@gmail.com  kermeen Deboo   kermeen   Deboo
7     QueenElsa@gmail.com            NaN     Queen    Elsa
8  PrincessAnna@gmail.com            NaN  Princess    Anna